### By Afshin Beh.

Created on April 1st, 2018

Last updated on April 1st, 2018

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

### Series

In [2]:
# create series labels

# number of elements in series 
series_len = 10
# index labels
index_labels = ['row' + str(i) for i in range(1, series_len + 1)]
print(index_labels)

['row1', 'row2', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9', 'row10']

In [3]:
# create series
series1 = Series(np.arange(series_len), index=index_labels)
series1

row1     0
row2     1
row3     2
row4     3
row5     4
row6     5
row7     6
row8     7
row9     8
row10    9
dtype: int64

In [4]:
# selecting rows

# select a row value
print(series1[2]) # integer indexing
print('----------')
print(series1['row3']) # row label indexing
print('----------')
# select a row
print(series1[[2]])
print('----------')
print(series1[['row3']])
print('----------')
# select multiple rows, selective
print(series1[[2, 5]])
print('----------')
print(series1[['row3', 'row6']])

2
----------
2
----------
row3    2
dtype: int64
----------
row3    2
dtype: int64
----------
row3    2
row6    5
dtype: int64
----------
row3    2
row6    5
dtype: int64

### DataFrame

In [5]:
# create dataframe

# number of rows
df1_row_count = 6
#number of columns
df1_col_count = 6
# row labels
df1_row_labels = ['row' + str(i) for i in range(1, df1_row_count+1)] 
# column labels 
df1_col_labels = ['col' + str(i) for i in range(1, df1_col_count+1)]
# define data frame
df1 = DataFrame(np.arange(1, 37).reshape((6, 6)), index=df1_row_labels, columns=df1_col_labels)
df1

      col1  col2  col3  col4  col5  col6
row1     1     2     3     4     5     6
row2     7     8     9    10    11    12
row3    13    14    15    16    17    18
row4    19    20    21    22    23    24
row5    25    26    27    28    29    30
row6    31    32    33    34    35    36

### Selecting elements, rows and columns

In [6]:
# return a specific element in data frame
df1.iloc[3, 2]
# or
df1.loc['row4', 'col3']

21

In [7]:
# return a row
df1.loc[['row1']]
# or
df1.iloc[[0]]

      col1  col2  col3  col4  col5  col6
row1     1     2     3     4     5     6

In [8]:
# return multiple rows
df1.loc[['row2', 'row4']]
# or
df1.iloc[[1, 3]]

      col1  col2  col3  col4  col5  col6
row2     7     8     9    10    11    12
row4    19    20    21    22    23    24

In [9]:
# return specific rows and columns
df1.loc[['row2', 'row4', 'row6'], ['col1', 'col3', 'col5']]
# or 
df1.iloc[[1, 3, 5], [0, 2, 4]]

      col1  col3  col5
row2     7     9    11
row4    19    21    23
row6    31    33    35

### Data Slicing

In the case of slicing position indexing the index after the colon is exculded from the selction. However, in slicing using label-based indexing, the index label after colon is included in selection.

In [10]:
# 'row2' to 'row6' of the data series
series1[1: 7]
# or 
series1['row2': 'row7']

row2    1
row3    2
row4    3
row5    4
row6    5
row7    6
dtype: int64

In [11]:
# row7' to the last element
series1[6:]
# or
series1[-4:]

row7     6
row8     7
row9     8
row10    9
dtype: int64

In [12]:
# the first element to 'row3' inclusive
series1[:3]
# or
series1[:-7]

row1    0
row2    1
row3    2
dtype: int64

In [13]:
# return all elements
series1.loc[:]

row1     0
row2     1
row3     2
row4     3
row5     4
row6     5
row7     6
row8     7
row9     8
row10    9
dtype: int64

In [14]:
# select 'row2' to 'row4', inclusive, from data frame
df1[1:4]

      col1  col2  col3  col4  col5  col6
row2     7     8     9    10    11    12
row3    13    14    15    16    17    18
row4    19    20    21    22    23    24

In [15]:
# select last row of data frame
df1[-1:]

      col1  col2  col3  col4  col5  col6
row6    31    32    33    34    35    36

In [16]:
# select rows with odd lable
# note that rows with even label locate at odd indexes
# for example index of the first row is 0, but the label is 'row1'
df1[::2]

      col1  col2  col3  col4  col5  col6
row1     1     2     3     4     5     6
row3    13    14    15    16    17    18
row5    25    26    27    28    29    30

### Data Filtering

In [17]:
# return values greater than 4 from data series
series1[series1 > 5]

row7     6
row8     7
row9     8
row10    9
dtype: int64

In [18]:
# return odd values from data series
series1[series1 % 2 != 0]

row2     1
row4     3
row6     5
row8     7
row10    9
dtype: int64

In [19]:
# return rows from data frame with values from 'col3' greater than 10 and smaller than 25
# use & for and, | for or
# don't forget parentheses for each condition
df1[(df1['col3'] > 10) & (df1['col3'] < 25)]

      col1  col2  col3  col4  col5  col6
row3    13    14    15    16    17    18
row4    19    20    21    22    23    24

### Setting values

In [20]:
# set a value at a specifc index
series1[1] = 100
# or
series1['row2'] = 100

series1

row1       0
row2     100
row3       2
row4       3
row5       4
row6       5
row7       6
row8       7
row9       8
row10      9
dtype: int64

In [21]:
# set values at multiple indexes to a specific value
series1[[2, 5, 7]] = 99
# or
series1[['row3', 'row6', 'row8']] = 99

series1

row1       0
row2     100
row3      99
row4       3
row5       4
row6      99
row7       6
row8      99
row9       8
row10      9
dtype: int64

In [22]:
# set values using slicing
series1[-2:] = 98
# or
series1['row9'] = 98

series1

row1       0
row2     100
row3      99
row4       3
row5       4
row6      99
row7       6
row8      99
row9      98
row10     98
dtype: int64

In [23]:
# dataframe, set value of a specific element
print(df1.iloc[3, 4])
df1.iloc[3,4] = 100
print(df1.iloc[3, 4])

23
100

In [24]:
# dataframe, set values in a column
df1['col2'] = 99
df1

      col1  col2  col3  col4  col5  col6
row1     1    99     3     4     5     6
row2     7    99     9    10    11    12
row3    13    99    15    16    17    18
row4    19    99    21    22   100    24
row5    25    99    27    28    29    30
row6    31    99    33    34    35    36

In [25]:
# dataframe, set values using slicing
df1.loc[:'row3', 'col5':] = 98
# or
df1.iloc[:3, 4:] = 98

df1

      col1  col2  col3  col4  col5  col6
row1     1    99     3     4    98    98
row2     7    99     9    10    98    98
row3    13    99    15    16    98    98
row4    19    99    21    22   100    24
row5    25    99    27    28    29    30
row6    31    99    33    34    35    36

### Missing Values

In [26]:
# make a dataframe 
df_with_nan = DataFrame(np.arange(1,26).reshape(5,5), 
                        index = ['row' + str(i) for i in range(0, 5)], 
                        columns = ['col' + str(i) for i in range(0, 5)])
# randomly set some value to NaN
np.random.seed(10)
# mask each elements in the dataframe with probablity of .2
df_with_nan = df_with_nan.mask(np.random.random(df_with_nan.shape) < .2)

df_with_nan

      col0  col1  col2  col3  col4
row0     1   NaN   3.0   4.0   5.0
row1     6   NaN   8.0   NaN   NaN
row2    11  12.0   NaN  14.0  15.0
row3    16  17.0  18.0  19.0  20.0
row4    21   NaN  23.0  24.0  25.0

In [27]:
# count missing values 

# in each column
df_with_nan.isnull().sum()
# in dataframe
df_with_nan.isnull().sum().sum()
# in specific columns
df_with_nan.isnull()['col1'].sum()
# in some columns
df_with_nan.isnull()[['col1', 'col3']].sum()

col1    3
col3    1
dtype: int64

In [28]:
# dropping missing values

# drop rows that include NaN values
df_with_nan.dropna()
# drop column that include NaN values
df_with_nan.dropna(axis=1)
# drop rows that include all NaN values
df_with_nan.dropna(how='all')

      col0  col1  col2  col3  col4
row0     1   NaN   3.0   4.0   5.0
row1     6   NaN   8.0   NaN   NaN
row2    11  12.0   NaN  14.0  15.0
row3    16  17.0  18.0  19.0  20.0
row4    21   NaN  23.0  24.0  25.0

In [44]:
# filling null values

# fill null values with zero
df_with_nan.fillna(0)
# fill null values of specific columns
# if you miss a column, null values will remain in that column
df_with_nan.fillna({'col1':100, 'col2':101, 'col3':102})
# fill null values with forward fill
# each missing element is filled by its preceding element in the column
df_with_nan.fillna(method='ffill')
# each missing element is filled by its preceding element in the row
df_with_nan.fillna(method='ffill', axis=1)
# fill missing values with average of each column
df_with_nan.apply(lambda i: i.fillna(i.mean()), axis=0)

      col0  col1  col2   col3   col4
row0     1  14.5   3.0   4.00   5.00
row1     6  14.5   8.0  15.25  16.25
row2    11  12.0  13.0  14.00  15.00
row3    16  17.0  18.0  19.00  20.00
row4    21  14.5  23.0  24.00  25.00